<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"07e1481ed03fe9cb1d7f963133e211fb271a0cf70889977e791e4bffe8611d29","plan_job_ref":"Job .github/workflows/_test-tf.yaml #270 at https://github.com/tx-pts-dai/github-workflows/actions/runs/13327469094","plan_out_hash":"7712e620c7d5b1c8f72dd7a21cfa763d2590e07ac8d50fdcefd30d8734b2dbdd","plan_hash":"15170cef7d2a178b5bc399cb710e1d4af73c7adfa3d979c56e8e99f071ab57b5","plan_text_format":"diff","version":"1.45.0"} -->
Terraform plan in __tests/terraform/s3__
With backend config: `bucket=tf-state-911453050078
key=sandbox1.tfstate
workspace_key_prefix=github-workflows
`
With var files: `tests/terraform/s3/environment/sandbox.tfvars`
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.this will be created
+   resource "random_id" "this" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 4
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

  # random_pet.this will be created
+   resource "random_pet" "this" {
+       id        = (known after apply)
+       length    = 2
+       separator = "-"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   random_id  = (known after apply)
+   random_pet = (known after apply)
```
</details>

:memo: Plan generated in [.github/workflows/_test-tf.yaml #270](https://github.com/tx-pts-dai/github-workflows/actions/runs/13327469094)